src/cf/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.КатегорииНоменклатуры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Артикул характеристики</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ДатаИзготовления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_Декларант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_МаркируемыйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ОрганВыдавшийСертификат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ОрганЗарегистрировавшийДекларацию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ор_Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СерияПроизводителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СертификатСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СрокДействияСертификата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_Фальсификат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_НаименованиеПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonForms/ор_УдалениеНеиспользуемыхСерий/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПланыОбмена.ГлавныйУзел() = Неопределено Тогда
		ОшибкаОткрытия = НСтр("ru = 'Данный сервис используется только в центральном узле распределенной базы!'");
		Возврат;
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
		ОшибкаОткрытия = НСтр("ru = 'Данный сервис не может быть использован, т.к. отключено использование характеристик номенклатуры!'");
		Возврат;
	КонецЕсли;
	
	Режим = 0;
	Элементы.СниматьФлагДляСерийНаОстатках.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ПустаяСтрока(ОшибкаОткрытия) Тогда
		ПоказатьПредупреждение(, ОшибкаОткрытия);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура РежимПриИзменении(Элемент)
	
	Элементы.СниматьФлагДляСерийНаОстатках.Доступность = НЕ (Режим = 0);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВыполнить(Команда)
	
	ТекстСообщения = "";
	
	Если Режим = 0 Тогда
		ПометитьНаУдалениеСервер(ТекстСообщения, УдалятьШтрихкоды);
	Иначе
		ПометитьКакНеИспользуемыеСервер(ТекстСообщения, УдалятьШтрихкоды, СниматьФлагДляСерийНаОстатках);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьМассивСерийДляУдаления()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Ссылка
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|ГДЕ
	|	НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА ХарактеристикиНоменклатуры.Владелец ССЫЛКА Справочник.КатегорииНоменклатуры
	|				ТОГДА ХарактеристикиНоменклатуры.Владелец.ор_ВестиСерийныйУчет
	|			ИНАЧЕ ХарактеристикиНоменклатуры.Владелец.КатегорияНоменклатуры.ор_ВестиСерийныйУчет
	|		КОНЕЦ";
	
	ТаблицаСсылок = Запрос.Выполнить().Выгрузить();
	МассивСсылок = ТаблицаСсылок.ВыгрузитьКолонку("Ссылка");
	
	МассивОбъектов = Новый Массив();
	
	// Регистры сведений.
	МассивОбъектов.Добавить(Метаданные.РегистрыСведений.ВыгруженныеОстаткиИнтернетМагазина);
	МассивОбъектов.Добавить(Метаданные.РегистрыСведений.ВыгруженныеЦеныИнтернетМагазина);
	МассивОбъектов.Добавить(Метаданные.РегистрыСведений.НоменклатураХарактеристикаИсключеннаяИзОбменаДляМагазинаСоцСетей);
	МассивОбъектов.Добавить(Метаданные.РегистрыСведений.НоменклатураХарактеристикаУдаленнаяИзОбменаДляМагазинаСоцСетей);
	МассивОбъектов.Добавить(Метаданные.РегистрыСведений.НоменклатураХарактеристикДляМагазинаСоцСетей);
	МассивОбъектов.Добавить(Метаданные.РегистрыСведений.НоменклатураХарактеристикДляМагазинаСоцСетейВиртуальныеКаталоги);
	МассивОбъектов.Добавить(Метаданные.РегистрыСведений.ор_ДействующиеПриоритеты);
	МассивОбъектов.Добавить(Метаданные.РегистрыСведений.ор_ПотребностьВОтсутствующемТоваре);
	МассивОбъектов.Добавить(Метаданные.РегистрыСведений.ор_РасположениеНоменклатуры);
	МассивОбъектов.Добавить(Метаданные.РегистрыСведений.ОстаткиТоваров);
	МассивОбъектов.Добавить(Метаданные.РегистрыСведений.ОстаткиТоваровМагазинаСоцСетей);
	МассивОбъектов.Добавить(Метаданные.РегистрыСведений.ОчередьРасчетаЦен);
	МассивОбъектов.Добавить(Метаданные.РегистрыСведений.КомплектацииПоУмолчанию);
	МассивОбъектов.Добавить(Метаданные.РегистрыСведений.СоставСегментаНоменклатуры);
	МассивОбъектов.Добавить(Метаданные.РегистрыСведений.РегистрацияПрослеживаемыхТоваров);
	МассивОбъектов.Добавить(Метаданные.РегистрыСведений.СерииНоменклатурыГарантии);
	МассивОбъектов.Добавить(Метаданные.РегистрыСведений.СопоставлениеФайловДляМагазинаСоцСетей);
	МассивОбъектов.Добавить(Метаданные.РегистрыСведений.СопутствующиеТовары);
	МассивОбъектов.Добавить(Метаданные.РегистрыСведений.СоставНаборов);
	МассивОбъектов.Добавить(Метаданные.РегистрыСведений.СпецификацииПоУмолчанию);
	МассивОбъектов.Добавить(Метаданные.РегистрыСведений.УзлыКорректировкиСтоимостиСписания);
	МассивОбъектов.Добавить(Метаданные.РегистрыСведений.УправлениеЗапасами);
	МассивОбъектов.Добавить(Метаданные.РегистрыСведений.ЦенникиКПечати);
	МассивОбъектов.Добавить(Метаданные.РегистрыСведений.ЦеныНоменклатуры);
	МассивОбъектов.Добавить(Метаданные.РегистрыСведений.ЦеныНоменклатурыКонтрагентов);
	
	
	// Регистры накопления.
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.ГрафикДвиженияЗапасов);
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.ДвиженияСерииНоменклатуры);
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.ЗаказыПокупателей);
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.ЗаказыПоставщикам);
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.ЗаказыНаПеремещение);
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.Закупки);
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.Запасы);
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.ЗапасыВРазрезеГТД);
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.ЗапасыКРасходуСоСкладов);
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.ЗапасыКПоступлениюНаСклады);
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.ЗапасыНаСкладах);
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.ЗапасыПереданные);
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.ЗапасыПереданныеВРазрезеГТД);
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.ЗапасыПринятыеВРазрезеГТД);
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.НачисленияБонусныхБаллов);
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.ПланыПродаж);
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.ПредоставленныеСкидки);
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.Продажи);
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.ПродажиПоДисконтнымКартам);
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.ПрослеживаемыеТовары);
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.РазмещениеЗаказов);
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.РезервыТоваровОрганизаций);
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.СерииНоменклатуры);
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.СерииНоменклатурыКПоступлению);
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.СерииНоменклатурыКРасходу);
	
	ТаблицаИспользуемыхСерий = НайтиПоСсылкам(МассивСсылок, Новый Массив(), МассивОбъектов);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаСсылок.Ссылка КАК Характеристика
	|ПОМЕСТИТЬ ТаблицаСсылок
	|ИЗ
	|	&ТаблицаСсылок КАК ТаблицаСсылок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСсылок.Характеристика
	|ИЗ
	|	ТаблицаСсылок КАК ТаблицаСсылок
	|ГДЕ
	|	НЕ ТаблицаСсылок.Характеристика В (&МассивСсылок)";
	
	ИмяКолонкиСсылки = ТаблицаИспользуемыхСерий.Колонки[0].Имя;
	ТаблицаИспользуемыхСерий.Свернуть(ИмяКолонкиСсылки);
	
	Запрос.УстановитьПараметр("ТаблицаСсылок", ТаблицаСсылок);
	Запрос.УстановитьПараметр("МассивСсылок", ТаблицаИспользуемыхСерий.ВыгрузитьКолонку(ИмяКолонкиСсылки));
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Характеристика");
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПометитьНаУдалениеСервер(ТекстСообщения, УдалятьШтрихкоды)
	
	МассивСсылок = ПолучитьМассивСерийДляУдаления();
	
	КоличествоПомеченных = 0;
	НепомеченныеТекст = "";
	Для Каждого Характеристика Из МассивСсылок Цикл
		
		ХарактеристикаОбъект = Характеристика.ПолучитьОбъект();
		ХарактеристикаОбъект.ПометкаУдаления = Истина;
		Попытка
			ХарактеристикаОбъект.Записать();
		Исключение
			НепомеченныеТекст = НепомеченныеТекст + ?(ЗначениеЗаполнено(НепомеченныеТекст), Символы.ПС, "")
									+ СтрШаблон(НСтр("ru = 'Не удалось пометить на удаление серию ""%1""!'"), СокрЛП(Характеристика));
			Продолжить;
		КонецПопытки;
		
		КоличествоПомеченных = КоличествоПомеченных + 1;
		
	КонецЦикла;
	
	ТекстСообщения = СтрШаблон(НСтр("ru = 'Помечено на удаление серий: %1'"), КоличествоПомеченных);
	
	Если ЗначениеЗаполнено(НепомеченныеТекст) Тогда
		ТекстСообщения = ТекстСообщения + Символы.ПС + НепомеченныеТекст;
	КонецЕсли;
	
	Если УдалятьШтрихкоды Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Штрихкоды.Штрихкод КАК Штрихкод,
		|	Штрихкоды.Характеристика КАК Характеристика
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Характеристика В(&МассивСсылок)";
		
		Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НаборЗаписей = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Штрихкод.Значение = Выборка.Штрихкод;
			НаборЗаписей.Отбор.Штрихкод.Использование = Истина;
			Попытка
				НаборЗаписей.Записать();
				ТекстСообщения = ТекстСообщения  + ?(ЗначениеЗаполнено(ТекстСообщения), Символы.ПС, "") +
									СтрШаблон(НСтр("ru = 'Серия ""%1"": удалены штрихкоды помеченной на удаление серии'"),
												СокрЛП(Выборка.Характеристика));
			Исключение
				ТекстСообщения = ТекстСообщения  + ?(ЗначениеЗаполнено(ТекстСообщения), Символы.ПС, "") +
									СтрШаблон(НСтр("ru = 'Не удалось удалить штрихкоды для серии ""%1""!'"),
												СокрЛП(Выборка.Характеристика));
			КонецПопытки;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПометитьКакНеИспользуемыеСервер(ТекстСообщения, УдалятьШтрихкоды, СниматьФлагДляСерийНаОстатках)
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыНаСкладах.Остатки КАК ЗапасыНаСкладахОстатки
	|		ПО ХарактеристикиНоменклатуры.Ссылка = ЗапасыНаСкладахОстатки.Характеристика
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ХарактеристикиНоменклатуры.Владелец ССЫЛКА Справочник.КатегорииНоменклатуры
	|				ТОГДА ХарактеристикиНоменклатуры.Владелец.ор_ВестиСерийныйУчет
	|			ИНАЧЕ ХарактеристикиНоменклатуры.Владелец.КатегорияНоменклатуры.ор_ВестиСерийныйУчет
	|		КОНЕЦ
	|	И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
	|	//ТекстУсловия";
	
	Если СниматьФлагДляСерийНаОстатках Тогда
		ТекстУсловия = "И (ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) = 0
		|				И НЕ ХарактеристикиНоменклатуры.Недействителен
		|			ИЛИ ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) > 0
		|				И ХарактеристикиНоменклатуры.Недействителен)";
	Иначе
		ТекстУсловия = "И ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) = 0
		|				И НЕ ХарактеристикиНоменклатуры.Недействителен";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ТекстУсловия", ТекстУсловия);
	
	МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Характеристика");
	
	ОбщееКоличествоПомеченных = 0;
	КоличествоПомеченныхНедействительных = 0;
	Для Каждого Характеристика Из МассивСсылок Цикл
		ХарактеристикаОбъект = Характеристика.ПолучитьОбъект();
		ХарактеристикаОбъект.Недействителен = НЕ ХарактеристикаОбъект.Недействителен;
		Попытка
			ХарактеристикаОбъект.Записать();
			ТекстСерии = СтрШаблон(НСтр("ru = 'Серия ""%1"" помечена как действительная.'"),
										СокрЛП(Характеристика));
			
			Если ХарактеристикаОбъект.Недействителен Тогда
				ТекстСерии = СтрЗаменить(ТекстСерии, "действительная", "недействительная");
				КоличествоПомеченныхНедействительных = КоличествоПомеченныхНедействительных + 1;
			КонецЕсли;
			
			ТекстСообщения = ТекстСообщения + ?(ЗначениеЗаполнено(ТекстСообщения), Символы.ПС, "") + Символы.ПС
								+ ТекстСерии;
			ОбщееКоличествоПомеченных = ОбщееКоличествоПомеченных + 1;
		Исключение
			ТекстСообщения = ТекстСообщения  + ?(ЗначениеЗаполнено(ТекстСообщения), Символы.ПС, "")
								+ СтрШаблон(НСтр("ru = 'Не удалось записать серию ""%1""!'"), СокрЛП(Характеристика));
		КонецПопытки;
	КонецЦикла;
	
	ТекстСообщения = СтрШаблон(НСтр("ru = 'Помечено серий как действительные: %1'"), ОбщееКоличествоПомеченных - КоличествоПомеченныхНедействительных)
							+ Символы.ПС
							+ ТекстСообщения;
	ТекстСообщения = СтрШаблон(НСтр("ru = 'Помечено серий как недействительные: %1'"), КоличествоПомеченныхНедействительных)
							+ Символы.ПС
							+ ТекстСообщения;
	
	Если УдалятьШтрихкоды Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Штрихкоды.Штрихкод КАК Штрихкод,
		|	Штрихкоды.Характеристика КАК Характеристика
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Характеристика В(&МассивСсылок)";
		
		Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НаборЗаписей = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Штрихкод.Значение = Выборка.Штрихкод;
			НаборЗаписей.Отбор.Штрихкод.Использование = Истина;
			Попытка
				НаборЗаписей.Записать();
				ТекстСообщения = ТекстСообщения  + ?(ЗначениеЗаполнено(ТекстСообщения), Символы.ПС, "")
									+ СтрШаблон(НСтр("ru = 'Серия ""%1"": удалены штрихкоды неиспользуемой серии'"), СокрЛП(Выборка.Характеристика));
			Исключение
				ТекстСообщения = ТекстСообщения  + ?(ЗначениеЗаполнено(ТекстСообщения), Символы.ПС, "")
									+ СтрШаблон(НСтр("ru = 'Не удалось удалить штрихкоды для серии ""%1""!'"), СокрЛП(Выборка.Характеристика));
			КонецПопытки;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
